/**
  ******************************************************************************
  * @file    ftgmac030_hal_eth.h
  * @author  B.C. Chen
  * @version V1.0.0
  * @date    3-Aug-2021
  * @brief   Header file of ETH HAL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center> COPYRIGHT(c) 2021 Faraday Technology Corporation </center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */ 

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __FTGMAC030_HAL_ETH_H
#define __FTGMAC030_HAL_ETH_H

#ifdef __cplusplus
 extern "C" {
#endif

#include "types.h"

typedef struct
{
	 uint32_t   ISR;            /* 0x00 */
	 uint32_t   IER;            /* 0x04 */
	 uint32_t   MAC_MADR;       /* 0x08 */
	 uint32_t   MAC_LADR;       /* 0x0c */
	 uint32_t   MAHT0;          /* 0x10 */
	 uint32_t   MAHT1;          /* 0x14 */
	 uint32_t   NPTXPD;         /* 0x18 */
	 uint32_t   RXPD;           /* 0x1c */
	 uint32_t   NPTXR_BADR;     /* 0x20 */
	 uint32_t   RXR_BADR;       /* 0x24 */
	 uint32_t   HPTXPD;         /* 0x28 */
	 uint32_t   HPTXR_BADR;     /* 0x2c */
	 uint32_t   TXITC;          /* 0x30 */
	 uint32_t   RXITC;          /* 0x34 */
	 uint32_t   APTC;           /* 0x38 */
	 uint32_t   DBLAC;          /* 0x3c */
	 uint32_t   DMAFIFOS;       /* 0x40 */
	     uint32_t   RESV0;          /* 0x44 */
	 uint32_t   TPAFCR;         /* 0x48 */
	 uint32_t   RBSR;           /* 0x4c */
	 uint32_t   MACCR;          /* 0x50 */
	 uint32_t   MACSR;          /* 0x54 */
	 uint32_t   TM;             /* 0x58 */
	     uint32_t   RESV1;          /* 0x5c */ /* not defined in spec */
	 uint32_t   PHYCR;          /* 0x60 */
	 uint32_t   PHYDATA;        /* 0x64 */
	 uint32_t   FCR;            /* 0x68 */
	 uint32_t   BPR;            /* 0x6c */
	 uint32_t   WOLCR;          /* 0x70 */
	 uint32_t   WOLSR;          /* 0x74 */
	 uint32_t   WFCRC;          /* 0x78 */
	     uint32_t   RESV2;          /* 0x7c */ /* not defined in spec */
	 uint32_t   WFBM1;          /* 0x80 */
	 uint32_t   WFBM2;          /* 0x84 */
	 uint32_t   WFBM3;          /* 0x88 */
	 uint32_t   WFBM4;          /* 0x8c */
	 uint32_t   NPTXR_PTR;      /* 0x90 */
	 uint32_t   HPTXR_PTR;      /* 0x94 */
	 uint32_t   RXR_PTR;        /* 0x98 */
	     uint32_t   RESV3;          /* 0x9c */ /* not defined in spec */
	 uint32_t   TX_CNT;         /* 0xa0 */
	 uint32_t   TX_MCOL_SCOL;   /* 0xa4 */
	 uint32_t   TX_ECOL_FAIL;   /* 0xa8 */
	 uint32_t   TX_LCOL_UND;    /* 0xac */
	 uint32_t   RX_CNT;         /* 0xb0 */
	 uint32_t   RX_BC;          /* 0xb4 */
	 uint32_t   RX_MC;          /* 0xb8 */
	 uint32_t   RX_PF_AEP;      /* 0xbc */
	 uint32_t   RX_RUNT;        /* 0xc0 */
	 uint32_t   RX_CRCER_FTL;   /* 0xc4 */
	 uint32_t   RX_COL_LOST;    /* 0xc8 */
	 uint32_t   BIST;           /* 0xcc */
	     uint32_t   RESV[6];        /* 0xd0~0xe4 */       
	 uint32_t   GISR;           /* 0xe8 */        
} ETH_TypeDef;

/*
 * Interrupt status register & interrupt enable register
 */
#define FTGMAC030_INT_RPKT_BUF                  (1 << 0)
#define FTGMAC030_INT_RPKT_FIFO                 (1 << 1)
#define FTGMAC030_INT_NO_RXBUF                  (1 << 2)
#define FTGMAC030_INT_RPKT_LOST                 (1 << 3)
#define FTGMAC030_INT_XPKT_ETH                  (1 << 4)
#define FTGMAC030_INT_XPKT_FIFO                 (1 << 5)
#define FTGMAC030_INT_NO_NPTXBUF                (1 << 6)
#define FTGMAC030_INT_XPKT_LOST                 (1 << 7)
#define FTGMAC030_INT_AHB_ERR                   (1 << 8)
#define FTGMAC030_INT_PHYSTS_CHG                (1 << 9)
#define FTGMAC030_INT_NO_HPTXBUF                (1 << 10)
#define FTGMAC030_INT_SYNC_IN                   (1 << 17)
#define FTGMAC030_INT_SYNC_OUT                  (1 << 18)
#define FTGMAC030_INT_DELAY_REQ_IN              (1 << 19)
